/* automatically generated by rust-bindgen 0.59.2 */

pub const SLANG_VC: u32 = 14;
pub const SLANG_CLANG: u32 = 0;
pub const SLANG_SNC: u32 = 0;
pub const SLANG_GHS: u32 = 0;
pub const SLANG_GCC: u32 = 0;
pub const SLANG_WIN64: u32 = 1;
pub const SLANG_WINRT: u32 = 0;
pub const SLANG_XBOXONE: u32 = 0;
pub const SLANG_X360: u32 = 0;
pub const SLANG_WIN32: u32 = 0;
pub const SLANG_ANDROID: u32 = 0;
pub const SLANG_LINUX: u32 = 0;
pub const SLANG_IOS: u32 = 0;
pub const SLANG_OSX: u32 = 0;
pub const SLANG_PS3: u32 = 0;
pub const SLANG_PS4: u32 = 0;
pub const SLANG_PSP2: u32 = 0;
pub const SLANG_WIIU: u32 = 0;
pub const SLANG_HAS_EXCEPTIONS: u32 = 1;
pub const SLANG_HAS_MOVE_SEMANTICS: u32 = 1;
pub const SLANG_HAS_ENUM_CLASS: u32 = 1;
pub const SLANG_PROCESSOR_X86_64: u32 = 1;
pub const SLANG_PROCESSOR_ARM: u32 = 0;
pub const SLANG_PROCESSOR_ARM_64: u32 = 0;
pub const SLANG_PROCESSOR_X86: u32 = 0;
pub const SLANG_PROCESSOR_POWER_PC: u32 = 0;
pub const SLANG_PROCESSOR_POWER_PC_64: u32 = 0;
pub const SLANG_PROCESSOR_FAMILY_X86: u32 = 1;
pub const SLANG_PROCESSOR_FAMILY_ARM: u32 = 0;
pub const SLANG_PROCESSOR_FAMILY_POWER_PC: u32 = 0;
pub const SLANG_PTR_IS_64: u32 = 1;
pub const SLANG_PTR_IS_32: u32 = 0;
pub const SLANG_LITTLE_ENDIAN: u32 = 1;
pub const SLANG_UNALIGNED_ACCESS: u32 = 1;
pub const SLANG_BIG_ENDIAN: u32 = 0;
pub const SLANG_FACILITY_WIN_GENERAL: u32 = 0;
pub const SLANG_FACILITY_WIN_INTERFACE: u32 = 4;
pub const SLANG_FACILITY_WIN_API: u32 = 7;

pub const SLANG_OPTIMIZATION_LEVEL_DEFAULT: ::std::os::raw::c_int = 1;
#[doc = "< Optimize aggressively."]
pub const SLANG_OPTIMIZATION_LEVEL_HIGH: ::std::os::raw::c_int = 2;
#[doc = "< Include optimizations that may take a very long time, or may involve severe space-vs-speed tradeoffs"]
pub const SLANG_OPTIMIZATION_LEVEL_MAXIMAL: ::std::os::raw::c_int = 3;
pub type _bindgen_ty_14 = ::std::os::raw::c_int;
#[doc = " A result code for a Slang API operation."]
#[doc = ""]
#[doc = "This type is generally compatible with the Windows API `HRESULT` type. In particular, negative values indicate"]
#[doc = "failure results, while zero or positive results indicate success."]
#[doc = ""]
#[doc = "In general, Slang APIs always return a zero result on success, unless documented otherwise. Strictly speaking"]
#[doc = "a negative value indicates an error, a positive (or 0) value indicates success. This can be tested for with the macros"]
#[doc = "SLANG_SUCCEEDED(x) or SLANG_FAILED(x)."]
#[doc = ""]
#[doc = "It can represent if the call was successful or not. It can also specify in an extensible manner what facility"]
#[doc = "produced the result (as the integral 'facility') as well as what caused it (as an integral 'code')."]
#[doc = "Under the covers SlangResult is represented as a int32_t."]
#[doc = ""]
#[doc = "SlangResult is designed to be compatible with COM HRESULT."]
#[doc = ""]
#[doc = "It's layout in bits is as follows"]
#[doc = ""]
#[doc = "Severity | Facility | Code"]
#[doc = "---------|----------|-----"]
#[doc = "31       |    30-16 | 15-0"]
#[doc = ""]
#[doc = "Severity - 1 fail, 0 is success - as SlangResult is signed 32 bits, means negative number indicates failure."]
#[doc = "Facility is where the error originated from. Code is the code specific to the facility."]
#[doc = ""]
#[doc = "Result codes have the following styles,"]
#[doc = "1) SLANG_name"]
#[doc = "2) SLANG_s_f_name"]
#[doc = "3) SLANG_s_name"]
#[doc = ""]
#[doc = "where s is S for success, E for error"]
#[doc = "f is the short version of the facility name"]
#[doc = ""]
#[doc = "Style 1 is reserved for SLANG_OK and SLANG_FAIL as they are so commonly used."]
#[doc = ""]
#[doc = "It is acceptable to expand 'f' to a longer name to differentiate a name or drop if unique without it."]
#[doc = "ie for a facility 'DRIVER' it might make sense to have an error of the form SLANG_E_DRIVER_OUT_OF_MEMORY"]
pub type SlangResult = i32;
#[doc = " A \"Universally Unique Identifier\" (UUID)"]
#[doc = ""]
#[doc = "The Slang API uses UUIDs to identify interfaces when"]
#[doc = "using `queryInterface`."]
#[doc = ""]
#[doc = "This type is compatible with the `GUID` type defined"]
#[doc = "by the Component Object Model (COM), but Slang is"]
#[doc = "not dependent on COM."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SlangUUID {
    pub data1: u32,
    pub data2: u16,
    pub data3: u16,
    pub data4: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_SlangUUID() {
    assert_eq!(
        ::std::mem::size_of::<SlangUUID>(),
        16usize,
        concat!("Size of: ", stringify!(SlangUUID))
    );
    assert_eq!(
        ::std::mem::align_of::<SlangUUID>(),
        4usize,
        concat!("Alignment of ", stringify!(SlangUUID))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SlangUUID>())).data1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SlangUUID),
            "::",
            stringify!(data1)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SlangUUID>())).data2 as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(SlangUUID),
            "::",
            stringify!(data2)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SlangUUID>())).data3 as *const _ as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(SlangUUID),
            "::",
            stringify!(data3)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<SlangUUID>())).data4 as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SlangUUID),
            "::",
            stringify!(data4)
        )
    );
}
#[repr(C)]
pub struct ISlangUnknown__bindgen_vtable(::std::os::raw::c_void);
#[doc = " Base interface for components exchanged through the API."]
#[doc = ""]
#[doc = "This interface definition is compatible with the COM `IUnknown`,"]
#[doc = "and uses the same UUID, but Slang does not require applications"]
#[doc = "to use or initialize COM."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangUnknown {
    pub vtable_: *const ISlangUnknown__bindgen_vtable,
}
#[test]
fn bindgen_test_layout_ISlangUnknown() {
    assert_eq!(
        ::std::mem::size_of::<ISlangUnknown>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangUnknown))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangUnknown>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangUnknown))
    );
}
#[doc = " A \"blob\" of binary data."]
#[doc = ""]
#[doc = "This interface definition is compatible with the `ID3DBlob` and `ID3D10Blob` interfaces."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangBlob {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_ISlangBlob() {
    assert_eq!(
        ::std::mem::size_of::<ISlangBlob>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangBlob))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangBlob>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangBlob))
    );
}
#[doc = " A (real or virtual) file system."]
#[doc = ""]
#[doc = "Slang can make use of this interface whenever it would otherwise try to load files"]
#[doc = "from disk, allowing applications to hook and/or override filesystem access from"]
#[doc = "the compiler."]
#[doc = ""]
#[doc = "It is the responsibility of"]
#[doc = "the caller of any method that returns a ISlangBlob to release the blob when it is no"]
#[doc = "longer used (using 'release')."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangFileSystem {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_ISlangFileSystem() {
    assert_eq!(
        ::std::mem::size_of::<ISlangFileSystem>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangFileSystem))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangFileSystem>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangFileSystem))
    );
}
pub type SlangFuncPtr = ::std::option::Option<unsafe extern "C" fn()>;
#[doc = " An interface that can be used to encapsulate access to a shared library. An implementation"]
#[doc = "does not have to implement the library as a shared library."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangSharedLibrary {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_ISlangSharedLibrary() {
    assert_eq!(
        ::std::mem::size_of::<ISlangSharedLibrary>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangSharedLibrary))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangSharedLibrary>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangSharedLibrary))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangSharedLibraryLoader {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_ISlangSharedLibraryLoader() {
    assert_eq!(
        ::std::mem::size_of::<ISlangSharedLibraryLoader>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangSharedLibraryLoader))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangSharedLibraryLoader>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangSharedLibraryLoader))
    );
}
pub type SlangPathType = ::std::os::raw::c_uint;
#[doc = "< Path specified specifies a directory."]
pub const SLANG_PATH_TYPE_DIRECTORY: ::std::os::raw::c_int = 0;
#[doc = "< Path specified is to a file."]
pub const SLANG_PATH_TYPE_FILE: ::std::os::raw::c_int = 1;
pub type _bindgen_ty_15 = ::std::os::raw::c_int;
pub type FileSystemContentsCallBack = ::std::option::Option<
    unsafe extern "C" fn(
        pathType: SlangPathType,
        name: *const ::std::os::raw::c_char,
        userData: *mut ::std::os::raw::c_void,
    ),
>;
#[doc = " An extended file system abstraction."]
#[doc = ""]
#[doc = "Implementing and using this interface over ISlangFileSystem gives much more control over how paths"]
#[doc = "are managed, as well as how it is determined if two files 'are the same'."]
#[doc = ""]
#[doc = "All paths as input char*, or output as ISlangBlobs are always encoded as UTF-8 strings."]
#[doc = "Blobs that contain strings are always zero terminated."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangFileSystemExt {
    pub _base: ISlangFileSystem,
}
#[test]
fn bindgen_test_layout_ISlangFileSystemExt() {
    assert_eq!(
        ::std::mem::size_of::<ISlangFileSystemExt>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangFileSystemExt))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangFileSystemExt>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangFileSystemExt))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangMutableFileSystem {
    pub _base: ISlangFileSystemExt,
}
#[test]
fn bindgen_test_layout_ISlangMutableFileSystem() {
    assert_eq!(
        ::std::mem::size_of::<ISlangMutableFileSystem>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangMutableFileSystem))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangMutableFileSystem>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangMutableFileSystem))
    );
}
pub type SlangWriterChannel = ::std::os::raw::c_uint;
pub const SLANG_WRITER_CHANNEL_DIAGNOSTIC: ::std::os::raw::c_int = 0;
pub const SLANG_WRITER_CHANNEL_STD_OUTPUT: ::std::os::raw::c_int = 1;
pub const SLANG_WRITER_CHANNEL_STD_ERROR: ::std::os::raw::c_int = 2;
pub const SLANG_WRITER_CHANNEL_COUNT_OF: ::std::os::raw::c_int = 3;
pub type _bindgen_ty_16 = ::std::os::raw::c_int;
pub type SlangWriterMode = ::std::os::raw::c_uint;
pub const SLANG_WRITER_MODE_TEXT: ::std::os::raw::c_int = 0;
pub const SLANG_WRITER_MODE_BINARY: ::std::os::raw::c_int = 1;
pub type _bindgen_ty_17 = ::std::os::raw::c_int;
#[doc = " A stream typically of text, used for outputting diagnostic as well as other information."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ISlangWriter {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_ISlangWriter() {
    assert_eq!(
        ::std::mem::size_of::<ISlangWriter>(),
        8usize,
        concat!("Size of: ", stringify!(ISlangWriter))
    );
    assert_eq!(
        ::std::mem::align_of::<ISlangWriter>(),
        8usize,
        concat!("Alignment of ", stringify!(ISlangWriter))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_TypeReflection {
    pub _address: u8,
}
pub const slang_TypeReflection_Kind_None: slang_TypeReflection_Kind = 0;
pub const slang_TypeReflection_Kind_Struct: slang_TypeReflection_Kind = 1;
pub const slang_TypeReflection_Kind_Array: slang_TypeReflection_Kind = 2;
pub const slang_TypeReflection_Kind_Matrix: slang_TypeReflection_Kind = 3;
pub const slang_TypeReflection_Kind_Vector: slang_TypeReflection_Kind = 4;
pub const slang_TypeReflection_Kind_Scalar: slang_TypeReflection_Kind = 5;
pub const slang_TypeReflection_Kind_ConstantBuffer: slang_TypeReflection_Kind = 6;
pub const slang_TypeReflection_Kind_Resource: slang_TypeReflection_Kind = 7;
pub const slang_TypeReflection_Kind_SamplerState: slang_TypeReflection_Kind = 8;
pub const slang_TypeReflection_Kind_TextureBuffer: slang_TypeReflection_Kind = 9;
pub const slang_TypeReflection_Kind_ShaderStorageBuffer: slang_TypeReflection_Kind = 10;
pub const slang_TypeReflection_Kind_ParameterBlock: slang_TypeReflection_Kind = 11;
pub const slang_TypeReflection_Kind_GenericTypeParameter: slang_TypeReflection_Kind = 12;
pub const slang_TypeReflection_Kind_Interface: slang_TypeReflection_Kind = 13;
pub const slang_TypeReflection_Kind_OutputStream: slang_TypeReflection_Kind = 14;
pub const slang_TypeReflection_Kind_Specialized: slang_TypeReflection_Kind = 15;
pub const slang_TypeReflection_Kind_Feedback: slang_TypeReflection_Kind = 16;
pub type slang_TypeReflection_Kind = ::std::os::raw::c_int;
pub const slang_TypeReflection_ScalarType_None: slang_TypeReflection_ScalarType = 0;
pub const slang_TypeReflection_ScalarType_Void: slang_TypeReflection_ScalarType = 1;
pub const slang_TypeReflection_ScalarType_Bool: slang_TypeReflection_ScalarType = 2;
pub const slang_TypeReflection_ScalarType_Int32: slang_TypeReflection_ScalarType = 3;
pub const slang_TypeReflection_ScalarType_UInt32: slang_TypeReflection_ScalarType = 4;
pub const slang_TypeReflection_ScalarType_Int64: slang_TypeReflection_ScalarType = 5;
pub const slang_TypeReflection_ScalarType_UInt64: slang_TypeReflection_ScalarType = 6;
pub const slang_TypeReflection_ScalarType_Float16: slang_TypeReflection_ScalarType = 7;
pub const slang_TypeReflection_ScalarType_Float32: slang_TypeReflection_ScalarType = 8;
pub const slang_TypeReflection_ScalarType_Float64: slang_TypeReflection_ScalarType = 9;
pub const slang_TypeReflection_ScalarType_Int8: slang_TypeReflection_ScalarType = 10;
pub const slang_TypeReflection_ScalarType_UInt8: slang_TypeReflection_ScalarType = 11;
pub const slang_TypeReflection_ScalarType_Int16: slang_TypeReflection_ScalarType = 12;
pub const slang_TypeReflection_ScalarType_UInt16: slang_TypeReflection_ScalarType = 13;
pub type slang_TypeReflection_ScalarType = SlangScalarType;
#[test]
fn bindgen_test_layout_slang_TypeReflection() {
    assert_eq!(
        ::std::mem::size_of::<slang_TypeReflection>(),
        1usize,
        concat!("Size of: ", stringify!(slang_TypeReflection))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_TypeReflection>(),
        1usize,
        concat!("Alignment of ", stringify!(slang_TypeReflection))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_TypeLayoutReflection {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_slang_TypeLayoutReflection() {
    assert_eq!(
        ::std::mem::size_of::<slang_TypeLayoutReflection>(),
        1usize,
        concat!("Size of: ", stringify!(slang_TypeLayoutReflection))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_TypeLayoutReflection>(),
        1usize,
        concat!("Alignment of ", stringify!(slang_TypeLayoutReflection))
    );
}
pub const slang_LayoutRules_Default: slang_LayoutRules = 0;
pub type slang_LayoutRules = SlangLayoutRules;
pub type slang_ProgramLayout = slang_ShaderReflection;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_ShaderReflection {
    pub _address: u8,
}
#[test]
fn bindgen_test_layout_slang_ShaderReflection() {
    assert_eq!(
        ::std::mem::size_of::<slang_ShaderReflection>(),
        1usize,
        concat!("Size of: ", stringify!(slang_ShaderReflection))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_ShaderReflection>(),
        1usize,
        concat!("Alignment of ", stringify!(slang_ShaderReflection))
    );
}
pub type slang_CompileStdLibFlags = u32;
#[doc = " A \"blob\" of binary data."]
#[doc = ""]
#[doc = "This interface definition is compatible with the `ID3DBlob` and `ID3D10Blob` interfaces."]
pub type slang_IBlob = ISlangBlob;
#[doc = " A global session for interaction with the Slang library."]
#[doc = ""]
#[doc = "An application may create and re-use a single global session across"]
#[doc = "multiple sessions, in order to amortize startups costs (in current"]
#[doc = "Slang this is mostly the cost of loading the Slang standard library)."]
#[doc = ""]
#[doc = "The global session is currently *not* thread-safe and objects created from"]
#[doc = "a single global session should only be used from a single thread at"]
#[doc = "a time."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_IGlobalSession {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_slang_IGlobalSession() {
    assert_eq!(
        ::std::mem::size_of::<slang_IGlobalSession>(),
        8usize,
        concat!("Size of: ", stringify!(slang_IGlobalSession))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_IGlobalSession>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_IGlobalSession))
    );
}
#[doc = "@brief A request for one or more compilation actions to be performed."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_ICompileRequest {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_slang_ICompileRequest() {
    assert_eq!(
        ::std::mem::size_of::<slang_ICompileRequest>(),
        8usize,
        concat!("Size of: ", stringify!(slang_ICompileRequest))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_ICompileRequest>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_ICompileRequest))
    );
}
#[doc = " Description of a code generation target."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_TargetDesc {
    #[doc = " The size of this structure, in bytes."]
    pub structureSize: usize,
    #[doc = " The target format to generate code for (e.g., SPIR-V, DXIL, etc.)"]
    pub format: SlangCompileTarget,
    #[doc = " The compilation profile supported by the target (e.g., \"Shader Model 5.1\")"]
    pub profile: SlangProfileID,
    #[doc = " Flags for the code generation target. Currently unused."]
    pub flags: SlangTargetFlags,
    #[doc = " Default mode to use for floating-point operations on the target."]
    pub floatingPointMode: SlangFloatingPointMode,
    #[doc = " Optimization level to use for the target."]
    pub optimizationLevel: SlangOptimizationLevel,
    #[doc = " The line directive mode for output source code."]
    pub lineDirectiveMode: SlangLineDirectiveMode,
    #[doc = " Whether to force `scalar` layout for glsl shader storage buffers."]
    pub forceGLSLScalarBufferLayout: bool,
}
#[test]
fn bindgen_test_layout_slang_TargetDesc() {
    assert_eq!(
        ::std::mem::size_of::<slang_TargetDesc>(),
        40usize,
        concat!("Size of: ", stringify!(slang_TargetDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_TargetDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_TargetDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_TargetDesc>())).structureSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(structureSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_TargetDesc>())).format as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_TargetDesc>())).profile as *const _ as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(profile)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_TargetDesc>())).flags as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_TargetDesc>())).floatingPointMode as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(floatingPointMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_TargetDesc>())).optimizationLevel as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(optimizationLevel)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_TargetDesc>())).lineDirectiveMode as *const _ as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(lineDirectiveMode)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_TargetDesc>())).forceGLSLScalarBufferLayout as *const _
                as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_TargetDesc),
            "::",
            stringify!(forceGLSLScalarBufferLayout)
        )
    );
}
pub type slang_SessionFlags = u32;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_PreprocessorMacroDesc {
    pub name: *const ::std::os::raw::c_char,
    pub value: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_slang_PreprocessorMacroDesc() {
    assert_eq!(
        ::std::mem::size_of::<slang_PreprocessorMacroDesc>(),
        16usize,
        concat!("Size of: ", stringify!(slang_PreprocessorMacroDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_PreprocessorMacroDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_PreprocessorMacroDesc))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_PreprocessorMacroDesc>())).name as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_PreprocessorMacroDesc),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_PreprocessorMacroDesc>())).value as *const _ as usize
        },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_PreprocessorMacroDesc),
            "::",
            stringify!(value)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_SessionDesc {
    #[doc = " The size of this structure, in bytes."]
    pub structureSize: usize,
    #[doc = " Code generation targets to include in the session."]
    pub targets: *const slang_TargetDesc,
    pub targetCount: SlangInt,
    #[doc = " Flags to configure the session."]
    pub flags: slang_SessionFlags,
    #[doc = " Default layout to assume for variables with matrix types."]
    pub defaultMatrixLayoutMode: SlangMatrixLayoutMode,
    #[doc = " Paths to use when searching for `#include`d or `import`ed files."]
    pub searchPaths: *const *const ::std::os::raw::c_char,
    pub searchPathCount: SlangInt,
    pub preprocessorMacros: *const slang_PreprocessorMacroDesc,
    pub preprocessorMacroCount: SlangInt,
}
#[test]
fn bindgen_test_layout_slang_SessionDesc() {
    assert_eq!(
        ::std::mem::size_of::<slang_SessionDesc>(),
        64usize,
        concat!("Size of: ", stringify!(slang_SessionDesc))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_SessionDesc>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_SessionDesc))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SessionDesc>())).structureSize as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(structureSize)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SessionDesc>())).targets as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(targets)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SessionDesc>())).targetCount as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(targetCount)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SessionDesc>())).flags as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(flags)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_SessionDesc>())).defaultMatrixLayoutMode as *const _
                as usize
        },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(defaultMatrixLayoutMode)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SessionDesc>())).searchPaths as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(searchPaths)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_SessionDesc>())).searchPathCount as *const _ as usize
        },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(searchPathCount)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_SessionDesc>())).preprocessorMacros as *const _ as usize
        },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(preprocessorMacros)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_SessionDesc>())).preprocessorMacroCount as *const _
                as usize
        },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SessionDesc),
            "::",
            stringify!(preprocessorMacroCount)
        )
    );
}
pub const slang_ContainerType_None: slang_ContainerType = 0;
pub const slang_ContainerType_UnsizedArray: slang_ContainerType = 1;
pub const slang_ContainerType_StructuredBuffer: slang_ContainerType = 2;
pub const slang_ContainerType_ConstantBuffer: slang_ContainerType = 3;
pub const slang_ContainerType_ParameterBlock: slang_ContainerType = 4;
pub type slang_ContainerType = ::std::os::raw::c_int;
#[doc = " A session provides a scope for code that is loaded."]
#[doc = ""]
#[doc = "A session can be used to load modules of Slang source code,"]
#[doc = "and to request target-specific compiled binaries and layout"]
#[doc = "information."]
#[doc = ""]
#[doc = "In order to be able to load code, the session owns a set"]
#[doc = "of active \"search paths\" for resolving `#include` directives"]
#[doc = "and `import` declrations, as well as a set of global"]
#[doc = "preprocessor definitions that will be used for all code"]
#[doc = "that gets `import`ed in the session."]
#[doc = ""]
#[doc = "If multiple user shaders are loaded in the same session,"]
#[doc = "and import the same module (e.g., two source files do `import X`)"]
#[doc = "then there will only be one copy of `X` loaded within the session."]
#[doc = ""]
#[doc = "In order to be able to generate target code, the session"]
#[doc = "owns a list of available compilation targets, which specify"]
#[doc = "code generation options."]
#[doc = ""]
#[doc = "Code loaded and compiled within a session is owned by the session"]
#[doc = "and will remain resident in memory until the session is released."]
#[doc = "Applications wishing to control the memory usage for compiled"]
#[doc = "and loaded code should use multiple sessions."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_ISession {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_slang_ISession() {
    assert_eq!(
        ::std::mem::size_of::<slang_ISession>(),
        8usize,
        concat!("Size of: ", stringify!(slang_ISession))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_ISession>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_ISession))
    );
}
#[doc = " A component type is a unit of shader code layout, reflection, and linking."]
#[doc = ""]
#[doc = "A component type is a unit of shader code that can be included into"]
#[doc = "a linked and compiled shader program. Each component type may have:"]
#[doc = ""]
#[doc = " Zero or more uniform shader parameters, representing textures,"]
#[doc = "buffers, etc. that the code in the component depends on."]
#[doc = ""]
#[doc = " Zero or more *specialization* parameters, which are type or"]
#[doc = "value parameters that can be used to synthesize specialized"]
#[doc = "versions of the component type."]
#[doc = ""]
#[doc = " Zero or more entry points, which are the individually invocable"]
#[doc = "kernels that can have final code generated."]
#[doc = ""]
#[doc = " Zero or more *requirements*, which are other component"]
#[doc = "types on which the component type depends."]
#[doc = ""]
#[doc = "One example of a component type is a module of Slang code:"]
#[doc = ""]
#[doc = " The global-scope shader parameters declared in the module are"]
#[doc = "the parameters when considered as a component type."]
#[doc = ""]
#[doc = " Any global-scope generic or interface type parameters introduce"]
#[doc = "specialization parameters for the module."]
#[doc = ""]
#[doc = " A module does not by default include any entry points when"]
#[doc = "considered as a component type (although the code of the"]
#[doc = "module might *declare* some entry points)."]
#[doc = ""]
#[doc = " Any other modules that are `import`ed in the source code"]
#[doc = "become requirements of the module, when considered as a"]
#[doc = "component type."]
#[doc = ""]
#[doc = "An entry point is another example of a component type:"]
#[doc = ""]
#[doc = " The `uniform` parameters of the entry point function are"]
#[doc = "its shader parameters when considered as a component type."]
#[doc = ""]
#[doc = " Any generic or interface-type parameters of the entry point"]
#[doc = "introduce specialization parameters."]
#[doc = ""]
#[doc = " An entry point component type exposes a single entry point (itself)."]
#[doc = ""]
#[doc = " An entry point has one requirement for the module in which"]
#[doc = "it was defined."]
#[doc = ""]
#[doc = "Component types can be manipulated in a few ways:"]
#[doc = ""]
#[doc = " Multiple component types can be combined into a composite, which"]
#[doc = "combines all of their code, parameters, etc."]
#[doc = ""]
#[doc = " A component type can be specialized, by \"plugging in\" types and"]
#[doc = "values for its specialization parameters."]
#[doc = ""]
#[doc = " A component type can be laid out for a particular target, giving"]
#[doc = "offsets/bindings to the shader parameters it contains."]
#[doc = ""]
#[doc = " Generated kernel code can be requested for entry points."]
#[doc = ""]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_IComponentType {
    pub _base: ISlangUnknown,
}
#[test]
fn bindgen_test_layout_slang_IComponentType() {
    assert_eq!(
        ::std::mem::size_of::<slang_IComponentType>(),
        8usize,
        concat!("Size of: ", stringify!(slang_IComponentType))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_IComponentType>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_IComponentType))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_IEntryPoint {
    pub _base: slang_IComponentType,
}
#[test]
fn bindgen_test_layout_slang_IEntryPoint() {
    assert_eq!(
        ::std::mem::size_of::<slang_IEntryPoint>(),
        8usize,
        concat!("Size of: ", stringify!(slang_IEntryPoint))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_IEntryPoint>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_IEntryPoint))
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_ITypeConformance {
    pub _base: slang_IComponentType,
}
#[test]
fn bindgen_test_layout_slang_ITypeConformance() {
    assert_eq!(
        ::std::mem::size_of::<slang_ITypeConformance>(),
        8usize,
        concat!("Size of: ", stringify!(slang_ITypeConformance))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_ITypeConformance>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_ITypeConformance))
    );
}
#[doc = " A module is the granularity of shader code compilation and loading."]
#[doc = ""]
#[doc = "In most cases a module corresponds to a single compile \"translation unit.\""]
#[doc = "This will often be a single `.slang` or `.hlsl` file and everything it"]
#[doc = "`#include`s."]
#[doc = ""]
#[doc = "Notably, a module `M` does *not* include the things it `import`s, as these"]
#[doc = "as distinct modules that `M` depends on. There is a directed graph of"]
#[doc = "module dependencies, and all modules in the graph must belong to the"]
#[doc = "same session (`ISession`)."]
#[doc = ""]
#[doc = "A module establishes a namespace for looking up types, functions, etc."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct slang_IModule {
    pub _base: slang_IComponentType,
}
#[test]
fn bindgen_test_layout_slang_IModule() {
    assert_eq!(
        ::std::mem::size_of::<slang_IModule>(),
        8usize,
        concat!("Size of: ", stringify!(slang_IModule))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_IModule>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_IModule))
    );
}
#[doc = " Argument used for specialization to types/values."]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct slang_SpecializationArg {
    #[doc = " The kind of specialization argument."]
    pub kind: slang_SpecializationArg_Kind,
    pub __bindgen_anon_1: slang_SpecializationArg__bindgen_ty_1,
}
#[doc = "< An invalid specialization argument."]
pub const slang_SpecializationArg_Kind_Unknown: slang_SpecializationArg_Kind = 0;
#[doc = "< Specialize to a type."]
pub const slang_SpecializationArg_Kind_Type: slang_SpecializationArg_Kind = 1;
pub type slang_SpecializationArg_Kind = i32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union slang_SpecializationArg__bindgen_ty_1 {
    #[doc = " A type specialization argument, used for `Kind::Type`."]
    pub type_: *mut slang_TypeReflection,
}
#[test]
fn bindgen_test_layout_slang_SpecializationArg__bindgen_ty_1() {
    assert_eq!(
        ::std::mem::size_of::<slang_SpecializationArg__bindgen_ty_1>(),
        8usize,
        concat!(
            "Size of: ",
            stringify!(slang_SpecializationArg__bindgen_ty_1)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<slang_SpecializationArg__bindgen_ty_1>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(slang_SpecializationArg__bindgen_ty_1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<slang_SpecializationArg__bindgen_ty_1>())).type_ as *const _
                as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SpecializationArg__bindgen_ty_1),
            "::",
            stringify!(type_)
        )
    );
}
#[test]
fn bindgen_test_layout_slang_SpecializationArg() {
    assert_eq!(
        ::std::mem::size_of::<slang_SpecializationArg>(),
        16usize,
        concat!("Size of: ", stringify!(slang_SpecializationArg))
    );
    assert_eq!(
        ::std::mem::align_of::<slang_SpecializationArg>(),
        8usize,
        concat!("Alignment of ", stringify!(slang_SpecializationArg))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<slang_SpecializationArg>())).kind as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(slang_SpecializationArg),
            "::",
            stringify!(kind)
        )
    );
}
#[doc = " A global session for interaction with the Slang library."]
#[doc = ""]
#[doc = "An application may create and re-use a single global session across"]
#[doc = "multiple sessions, in order to amortize startups costs (in current"]
#[doc = "Slang this is mostly the cost of loading the Slang standard library)."]
#[doc = ""]
#[doc = "The global session is currently *not* thread-safe and objects created from"]
#[doc = "a single global session should only be used from a single thread at"]
#[doc = "a time."]
pub type SlangSession = slang_IGlobalSession;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SlangProgramLayout {
    _unused: [u8; 0],
}
#[doc = "@brief A request for one or more compilation actions to be performed."]
pub type SlangCompileRequest = slang_ICompileRequest;
extern "C" {
